In [1]:
import pandas as pd

In [20]:
df1 = pd.DataFrame({
    '选手1':{'001':100,'002':883,'003':604},
    '选手2':{'001':156,'002':868,'003':654},
    '选手3':{'001':196,'002':884,'003':646},
    '选手4':{'001':156,'002':858,'003':649},
})
df1

     选手1  选手2  选手3  选手4
001  100  156  196  156
002  883  868  884  858
003  604  654  646  649

# 关于df的统计方法-要用axis=0（默认）/1指明方向

In [3]:
df1.mean()

选手1    529.000000
选手2    559.333333
选手3    575.333333
选手4    554.333333
dtype: float64

In [4]:
df1.mean(axis=1)

001    152.00
002    873.25
003    638.25
dtype: float64

**axis=0为默认且只对↓方向的东西有作用（如：列中数据，标签索引），axis=1只对→方向东西有作用（如：每一行）**

*掐头去尾求平均*

In [5]:
def trim_mean(data):
    data_max = data.max()
    data_min = data.min()
    data_len = len(data)
    data_sum = data.sum()
    trim_mean = (data_sum-data_max-data_min)/(data_len-2)
    return trim_mean

In [6]:
df1.apply(trim_mean)

选手1    604.0
选手2    654.0
选手3    646.0
选手4    649.0
dtype: float64

In [7]:
df1.apply(trim_mean,axis=1)

001    156.0
002    875.5
003    647.5
dtype: float64

*传给apply()的函数作用于df的每行/每列上，而传给applymap()的函数会作用于df的每一个元素<br>无论是apply还是applymap都是返回一个新的df原df并未改变<br>applymap已经被pandas官方忽略了，仍可以用但不推荐，可以使用更强的map()函数去帮助实现applymap的功能！！！*

In [8]:
df1.applymap( lambda x: x-1000 )

C:\Users\杨加春\AppData\Local\Temp\ipykernel_19680\1612997059.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df1.applymap( lambda x: x-1000 )

     选手1  选手2  选手3  选手4
001 -900 -844 -804 -844
002 -117 -132 -116 -142
003 -396 -346 -354 -351

In [9]:
df1.map( lambda x: x-1000 )

     选手1  选手2  选手3  选手4
001 -900 -844 -804 -844
002 -117 -132 -116 -142
003 -396 -346 -354 -351

In [10]:
df1.describe()

              选手1         选手2         选手3         选手4
count    3.000000    3.000000    3.000000    3.000000
mean   529.000000  559.333333  575.333333  554.333333
std    396.851358  365.318126  349.401393  360.447407
min    100.000000  156.000000  196.000000  156.000000
25%    352.000000  405.000000  421.000000  402.500000
50%    604.000000  654.000000  646.000000  649.000000
75%    743.500000  761.000000  765.000000  753.500000
max    883.000000  868.000000  884.000000  858.000000

**describe()会自动忽略非数字列中数据只统计纯数字列中数据！**

# 练习

#### 写出导入pandas的语句，并且给pandas别名为`pd`。

In [8]:
import pandas as pd
import numpy as np

#### 创建一个名为`students`的DataFrame，包含数据如下：
```
{
"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
}
 
 要求学号（001、002等）为索引，姓名、考试1、考试2、考试3为列名，并输出创建好的DataFrame。

In [2]:
students = pd.DataFrame({
 "001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
}
 ).T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

#### **创建一个叫`student_average`的DataFrame，索引为学号，包含姓名列（列名为“姓名”），以及计算出四次考试平均值后的结果列（列名为“平均分”）。**

In [3]:
students.loc[:,'考试1':'考试3']

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [4]:
students.loc[:,'考试1':'考试3'].mean(axis=1)

001    90.666667
002    92.333333
003    85.333333
004    87.666667
005    92.666667
006    87.333333
dtype: object

In [5]:
print(type(students.loc[:,'考试1':'考试3'].mean(axis=1)))

<class 'pandas.core.series.Series'>

可以采用df1 = pd.DataFrame({'属性1':a,'属性2':b,属性3'':c})，其中abc都是series定义的

In [16]:
print(type(students['姓名']))

<class 'pandas.core.series.Series'>

In [7]:
average = students.loc[:,'考试1':'考试3'].mean(axis=1)
name = students['姓名']
student_average = pd.DataFrame({'姓名':name,'平均数':average})
student_average

     姓名        平均数
001  小陈  90.666667
002  小李  92.333333
003  小王  85.333333
004  小张  87.666667
005  小赵  92.666667
006  小周  87.333333

#### 输出每次考试第二高的分数组成的Series，可以尝试结合匿名函数。

*apply函数可以把（）内的函数作用于df的每一列（axis=0不写则默认），或每一行（axis=1）,这里可以借用numpy的sort()函数,倒二用-2去检索！*

In [9]:
students.loc[:,'考试1':'考试3']

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [10]:
students.loc[:,'考试1':'考试3'].apply(lambda x : np.sort(x)[-2] )

考试1    91
考试2    92
考试3    94
dtype: int64

*把该表中每一列（不写默认axis=0）数据作为一个整体作为参数x，都调用定义的匿名函数*

#### 根据以下规则，输出每个学号对应的四次考试的等级：
- A+：平均分 >= 95
- A：90 <= 平均分 < 95
- B+：85 <= 平均分 < 90
- B：80 <= 平均分 < 85
- C+：75 <= 平均分 < 80
- C：平均分 < 75

In [12]:
def get_grade(score):
    if score>=95:
        return 'A+'
    elif score>=90:
        return 'A'
    elif score>=85:
        return 'B+'
    elif score>=80:
        return 'B'
    elif score>=75:
        return 'C+'
    else:
        return 'C'

In [13]:
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [16]:
s = students.loc[:,'考试1':'考试3']
s

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [17]:
s.map(get_grade)

    考试1 考试2 考试3
001  B+  A+   A
002   A   A   A
003  B+   B  B+
004  C+  B+  A+
005  A+   A   A
006   B  B+   A

map可以把df中每一个数据都调用对应函数

#### 展示`students`每个考试分数数据列的统计信息，包括个数、平均值、标准差、四分位数等。

In [18]:
students.describe()

        姓名  考试1  考试2  考试3
count    6    6    6    6
unique   6    6    5    5
top     小陈   85   89   92
freq     1    1    2    2

In [21]:
df1.describe()

              选手1         选手2         选手3         选手4
count    3.000000    3.000000    3.000000    3.000000
mean   529.000000  559.333333  575.333333  554.333333
std    396.851358  365.318126  349.401393  360.447407
min    100.000000  156.000000  196.000000  156.000000
25%    352.000000  405.000000  421.000000  402.500000
50%    604.000000  654.000000  646.000000  649.000000
75%    743.500000  761.000000  765.000000  753.500000
max    883.000000  868.000000  884.000000  858.000000

你发现对于students的描述与之前df1不同<br>统计数据：个数、平均值、标准差、四分位数等只对数字类型的列展示而students中的数字的数据类型是object，数字，字符串都是object的子类<br>如果数字是object类型而非int/float数字类型那么pandas就不会给我们展示std,count,mean等统计信息<br>当df中既有数字类型列又有字符串类型列那么describe可以忽略df中非数字类型列只统计数字类型列,但是students中数字全是objects类型数据而不是数字类型那么pandas就认为students表中没有数字列！

In [22]:
students['考试1']

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [23]:
df1['选手1']

001    100
002    883
003    604
Name: 选手1, dtype: int64

In [24]:
students['考试1'] = students['考试1'].astype('int')
students['考试2'] = students['考试2'].astype('int')
students['考试3'] = students['考试3'].astype('int')
students.describe()

             考试1        考试2        考试3
count   6.000000   6.000000   6.000000
mean   86.333333  89.500000  92.166667
std     6.314006   4.722288   2.136976
min    79.000000  81.000000  89.000000
25%    82.000000  89.000000  91.250000
50%    85.500000  90.000000  92.000000
75%    89.750000  91.750000  93.500000
max    96.000000  95.000000  95.000000